{"days":[{"Id":2,"Weekday":"Saturday","Slots":[{"Id":0,"name":"Morning 10:00 am to 2:00 pm","games":[{"Id":17,"Day":2,"Slot":0,"GameType":"Cyberpunk Red","StoryTellerId":101,"StoryTellerName":"Andrew L. ","Title":"Minutes to Midnight","Description":"Night City, the hint is in the name. During the daytime it is a thriving hub of commerce as it seeks to claw it’s way back to life following the Arasaka Tower event. But day is only the beginning. It is the night when the city comes alive. When the masses blow off steam in the Neon lights and crashing sounds of the clubs. Night when the predators come out. You’re one of those predators. You do all sorts of work that needs doing, most of it violent, all of it less than legal. And tonight you are on the hunt.<br /><br />Last week the job went sideways, your choom Toni took the bullet and the rest of your crew narrowly escaped with your hides. Now you’re healed. And you’re pissed. You have a corpo to put six feet under for double dealing and you’ve got the crew and hardware to do it. Only one problem. They’ve gone to ground. So now you’re on a clock. You know the hit squad is hunting you. If you can get to their boss fast enough you live…if not, you die. Welcome to Night City Choombas!<br /><br />Cyberpunk Red is the latest version of the Cyberpunk line of games from R. Talsorian. Advancing the setting to 2045 and streamlining the rules the game is easy to pick up and will have you into the Cyberpunk genre in no time no experience required. Pre-generated characters will be provided. While the focus of cyberpunk is your character fighting back for their own piece of turf, please note that this game is Rated R as it will touch on core cyberpunk themes of Exploitation and social caste structures as well as the general hopelessness of the setting. <br /><br />Trigger warnings include: Suicide, Medical Debt, Body Modification, Indentured Servitude, Drugs.<br />Game Rating: R<br />Safety Tools: X-Card, Lines & Veils, Exit the Scene, Open Door<br />Players: 4 max (for combat speed)"},{"Id":18,"Day":2,"Slot":0,"GameType":"Dungeons & Dragons 5th","StoryTellerId":102,"StoryTellerName":"Michael Pay","Title":"Chybisa: The Forgotten Kingdom","Description":"Ilvirians? Polite, but a few pints short!: There has been some thieving going on and the King of Kanday has set out a proclamation. There is 100 gold piece bounty for every practicing member of the Ilvir “cult/faith” captured and returned to Tashal Castle for trial. The Ilvirians worship the Master of Araka Kali. Some say she is a creature, some say he is a myth, and some say it is neither, but a God to be worshipped. The Ilvirians see it that way anyway, and they are on their way to a festival, to see the ‘New Life’ come to be; which will usher them into a new paradise where all creatures will not want and live in Harmony. Are they a cult? Are they on some wild fauna? OR: Are they the few that see something more, that there will be peace and a unified kingdom under his wise leadership?  <br /><br /> <br /><br />Players are 5-6th level. You will roll three items from table b c d. One from each table. Using the same character from the previous one shot earlier in the day. Means you get one roll on table D.<br /><br />Note: Araka Kali is a small ancient mound of evil. It will take more than brawn to succeed in this place.<br /><br />Good Luck. 😊"},{"Id":19,"Day":2,"Slot":0,"GameType":"Dungeons & Dragons 5th","StoryTellerId":103,"StoryTellerName":"Nathan D. ","Title":"","Description":"a 5th ed dnd game with pre-generated characters on a massive 3d printed terrain dungeon.  Players can choose 1 of multiple adventures to go on from dungeon crawls, murder mystery's, or search and rescue's.  3d printed rewards and items available are available at the end of games"},{"Id":20,"Day":2,"Slot":0,"GameType":"7th Sea","StoryTellerId":104,"StoryTellerName":"Jason M. ","Title":"","Description":""},{"Id":21,"Day":2,"Slot":0,"GameType":"Dungeons & Dragons 5th","StoryTellerId":105,"StoryTellerName":"Sean N. ","Title":"Sleepy Hollow Revisited","Description":"Mayor Hudson has invited you as proven investigators, fighters, and learned individuals, to come to the small hamlet of Sleepy Hollow. Years have passed since the unfortunate incidents surrounding Ichabod Crane and The Headless Horseman, however strange events have recently started jarring the residents of the town, including stirring of the dead in local crypts, leading some to fear the decapitated legend  has returned once more...<br /><br />A 5e DnD game for 5-6 players (characters supplied) - just in time for Halloween!"},{"Id":22,"Day":2,"Slot":0,"GameType":"Shadowrun","StoryTellerId":106,"StoryTellerName":"Bryan M. ","Title":"All Dogs Don’t Become Paw Patrol","Description":"While some dogs get to join the Paw Patrol and live in luxury some dogs are cast out to live on the scraps of society. Those class traitors, The Paw Patrol need to be taken down."},{"Id":23,"Day":2,"Slot":0,"GameType":"Mork Borg","StoryTellerId":107,"StoryTellerName":"Ian M. ","Title":"The Belly of Süfra","Description":"Beyond the dire peaks of Bergen Chrypt, west, across the Endless Sea, lies an archipelago longing to be forgotten. Whispered by decaying elders in fever-dreams, or by weather-beaten mariners slinking port to port, the Akhän Isles persist in rumours. The desperate and the avaricious seek them out, fleeing the entropic apocalypse or lusting for untouched riches. At the centre of the main ilse squats Süfra, belching noxious fumes and roiling with the promise of fire and death. Yet, both the local warbands and adventures to the Isles are drawn to the volcano. What riches lie within? Is it worth the attempt?"},{"Id":24,"Day":2,"Slot":0,"GameType":"Cyberpunk Red","StoryTellerId":108,"StoryTellerName":"Terry B. ","Title":"","Description":""}]},{"Id":1,"name":"Afternoon 3:00 pm to 7:00 pm","games":[{"Id":39,"Day":2,"Slot":1,"GameType":"Fantasy world Island of Harn","StoryTellerId":102,"StoryTellerName":"Michael Pay","Title":"A Taztos Holiday","Description":"It is the year You are on your way to the Pamesani Games in Tharda. A spectacular event where creatures and “sports enthusiasts” meet for a duel to the death in the main arena. Joining one of the salt trade caravans out of the Kingdom of Kanday possibly as hired Trail Scouts or merely looking for a little company on the way between the two lands, you see “Red Smoke” to the North and to the East. Red Smoke means the Tulwyn are on the move and seek justice. Heading South is known to be certain death. You have one slim chance, a small garrison mans the fort at Taztoz! With this much Red Smoke will you see another dawn.<br /><br /> <br /><br />Players are 4-5th level. You will roll at the table under witness a two items from tables B and C in the DMG.<br /><br />Good Bye...cough…LUCK!<br /><br />I meant…umm…Good Luck…"},{"Id":40,"Day":2,"Slot":1,"GameType":"Dungeons & Dragons 5th","StoryTellerId":103,"StoryTellerName":"Nathan D. ","Title":"","Description":"a 5th ed dnd game with pre-generated characters on a massive 3d printed terrain dungeon.  Players can choose 1 of multiple adventures to go on from dungeon crawls, murder mystery's, or search and rescue's.  3d printed rewards and items available are available at the end of games"},{"Id":41,"Day":2,"Slot":1,"GameType":"Game ","StoryTellerId":65,"StoryTellerName":"Justin L.","Title":"","Description":""},{"Id":42,"Day":2,"Slot":1,"GameType":"Shadowrun","StoryTellerId":104,"StoryTellerName":"Jason M. ","Title":"","Description":""},{"Id":44,"Day":2,"Slot":1,"GameType":"Star Wars 5e","StoryTellerId":106,"StoryTellerName":"Bryan M. ","Title":"Star Smurf","Description":"A long time ago but well after the sequels, in a galaxy far, far away... While Smurfs are normally a peaceful race, they have had to adapt survive. Most becoming mercenaries, bounty hunters and smugglers."},{"Id":45,"Day":2,"Slot":1,"GameType":"Call of Cthulhu/TMNT","StoryTellerId":107,"StoryTellerName":"Ian M. ","Title":"The Unseeables","Description":"Betrayed and left for dead by fellow Prohibition Agents, Hamato Yoshi awoke in a chemical bog at the Black Tom munitions factory. In addition to finding himself alive, but changed, he also found four young turtles scrabbling in the muck. He went into hiding with the four reptiles and was amazed to see them grow, mutate, and exhibit signs of intelligence. Training them in the shadows, Hamato plans righteous vengeance, as the corruption and vice that nearly took his life continues uncontested on the streets of New York. <br /><br />The Unseeables is a Call of Cthulhu adventure for 3-5 players, where players take on the roles of Teenage Mutant Agent Turtles and their teacher, in their efforts to stamp out the mob."},{"Id":46,"Day":2,"Slot":1,"GameType":"Scum & Villainy","StoryTellerId":101,"StoryTellerName":"Andrew L. ","Title":"Solar Flare","Description":"It should have been an easy job. Pull up the wreck of the ship as it drifted towards the Belt of Fire and retrieve a cargo the last owners had misplaced. Of course it always sounds simple when you are planet side. Out here in the cold it was often less than that.  But now you’re in it. You owe way too much on the Cerebus to come home empty handed and so you grab the plasma cutter and set to work on the hatch. After all, how bad can it go for you and your crew?<br /><br />Scum and Villainy is a Forged in the Dark game based on the award winning Blades in the Dark System. A Narrative heavy system, it seeks to get rid of the slow downs in the game by rewarding you for getting into the action through it’s creative engagement roll and flashback systems. One part Star wars, one part Firefly, one part Killjoys, this game is suitable for anyone regardless of if you have experience with the system or not. <br /><br />Game Rating: PG-16, Pre-generated characters will be provided.<br />Safety Tools: X-Card, Lines & Veils, Exit the Scene, Open Door<br />Players: 3 max due to Narrative system"},{"Id":47,"Day":2,"Slot":1,"GameType":"Dungeons & Dragons 5th","StoryTellerId":27,"StoryTellerName":"Derek M.","Title":"","Description":""},{"Id":48,"Day":2,"Slot":1,"GameType":"Game ","StoryTellerId":109,"StoryTellerName":"Mac. F","Title":"","Description":""},{"Id":49,"Day":2,"Slot":1,"GameType":"Cyberpunk Red","StoryTellerId":108,"StoryTellerName":"Terry B. ","Title":"","Description":""}]},{"Id":2,"name":"Evening 8:00 pm to Midnight","games":[{"Id":62,"Day":2,"Slot":2,"GameType":"Dungeons & Dragons 5th","StoryTellerId":103,"StoryTellerName":"Nathan D. ","Title":"","Description":"a 5th ed dnd game with pre-generated characters on a massive 3d printed terrain dungeon.  Players can choose 1 of multiple adventures to go on from dungeon crawls, murder mystery's, or search and rescue's.  3d printed rewards and items available are available at the end of games"},{"Id":63,"Day":2,"Slot":2,"GameType":"Game ","StoryTellerId":110,"StoryTellerName":"Mac F. ","Title":"","Description":""},{"Id":64,"Day":2,"Slot":2,"GameType":"Board Game","StoryTellerId":111,"StoryTellerName":"Derek M. ","Title":"","Description":""},{"Id":65,"Day":2,"Slot":2,"GameType":"Dungeons & Dragons 5th","StoryTellerId":105,"StoryTellerName":"Sean N. ","Title":"Sleepy Hollow Revisited","Description":"Mayor Hudson has invited you as proven investigators, fighters, and learned individuals, to come to the small hamlet of Sleepy Hollow. Years have passed since the unfortunate incidents surrounding Ichabod Crane and The Headless Horseman, however strange events have recently started jarring the residents of the town, including stirring of the dead in local crypts, leading some to fear the decapitated legend  has returned once more...<br /><br />A 5e DnD game for 5-6 players (characters supplied) - just in time for Halloween!"},{"Id":66,"Day":2,"Slot":2,"GameType":"Dark streets and Darker secrets","StoryTellerId":65,"StoryTellerName":"Justin L.","Title":"Don’t touch that dial","Description":"You’ve finally got your shot, an affiliate network has greenlit your pilot of “Haunted houses of the West”. Your crew, medium, and corporate stooge are there for what could be a career making show. But, is it more than you’ve bargained for?<br /><br /> <br /><br />A mature game using “Dark streets and Darker secrets TTRPG rules."},{"Id":67,"Day":2,"Slot":2,"GameType":"Dungeons & Dragons 5th","StoryTellerId":102,"StoryTellerName":"Michael Pay","Title":"A Taztos Holiday","Description":""},{"Id":68,"Day":2,"Slot":2,"GameType":"Call of Cthulhu/ 40k","StoryTellerId":107,"StoryTellerName":"Ian M. ","Title":"Coils of the Serpent","Description":"9000039.M01 Anguis System, Crusis Sector. Contact with Astra Militarum assets in the system have abruptly ceased, following a series of concerning reports. Subsequent inquiry by a High Command flotilla transmitted a burst of seemingly impossible auspex data before ceasing their own communication. Further attempts to contact assets in the system have yielded no results. Inquisitor Atrum Nex, of the Ordo Hereticus, will lead her retinue to ascertain the status of the assets within the system and perform enquiry into the cause of the communications aberration. <br /><br />Coils of the Serpent is a Call of Cthulhu adventure for 3-5 players, set in the Warhammer 40,000 universe. Uncover the secrets at the heart of this dark corner of the galaxy."},{"Id":69,"Day":2,"Slot":2,"GameType":"Transformers: Beast Wars","StoryTellerId":112,"StoryTellerName":"John P. ","Title":"Game of Predicons","Description":" Welcome to your new life as a Predacon: warning side effects may include uncontrollable rage, backstabbing alliances and over-explicit monologuing.  <br /><br />As a new recruit in Megatron’s band of golden disk thieves, you have now joined the soon to be winning faction of the Beast Wars. Prepare for glory as, under second in command Scorponok’s stinger, you are molded into a no-mercy soldier ready to crush any Maximal under your claws (or insert weaponized animal appendage of your choice). But all is not energon and chrome polish as you soon will find out. The Predacon family consists of back stabbing, double dealing bots and it is up to you to decide how you want to play the game. Will you become the star Predacon and glory in the praise of Megatron, or do you want to side with the many eager (and totally honest) players of the game and give yourself a turn at the helm of leadership? Just watch for energon webs along the way.... <br /><br />Players will be given an hour at the beginning to make their own character… is that an albatross ship entering the atmosphere? Have fun taking you and your most worthy bot shields… I mean companions... to join the Predacon Elite.  "},{"Id":70,"Day":2,"Slot":2,"GameType":"Ten Candels ","StoryTellerId":52,"StoryTellerName":"Jason M.","Title":"","Description":""}]}]}],"boardgame":null,"storytellers":[{"Id":1,"Name":"Name","Description":"Description"},{"Id":2,"Name":"Adam G","Description":"Adam started roleplaying when he was 8, and has played or GM'd in many systems, including Pathfinder, D20 Modern, Top Secret, Marvel and every version of D&D. He loves character and story driven games, and enjoys creatively interpreting rules whenever pla"},{"Id":3,"Name":"Alec M","Description":""},{"Id":4,"Name":"Andrew V","Description":"Gamer since the early 80’s and designer since the early 90’s. Best known works are the Fate of the Norns line of games: Ragnarok, Gulveig and Vigridr."},{"Id":5,"Name":"Andrew W","Description":""},{"Id":6,"Name":"Andrew Y","Description":""},{"Id":7,"Name":"Anthony U","Description":""},{"Id":8,"Name":"Brian F","Description":""},{"Id":9,"Name":"Bryan C","Description":""},{"Id":10,"Name":"Bryan M","Description":"For more than five years Bryan has been taking childhood memories and warping them into twisted games, that are just too much fun to pass up."},{"Id":11,"Name":"Chris C","Description":"Chris won the story teller of the year award in 2002 and next year will be publishing his first RPG game “Knights of the Hidden Sun”. Whenever you get the chance play with this man his games are too fun to pass up."},{"Id":12,"Name":"Chris M","Description":""},{"Id":13,"Name":"Chris T","Description":""},{"Id":14,"Name":"Cody M","Description":""},{"Id":15,"Name":"Corey R","Description":""},{"Id":16,"Name":"Craig M","Description":"Craig is a old school story teller, who has been running games for us every year since the first year of the convention. His game are quite fun, well worth checking out."},{"Id":17,"Name":"Dale D","Description":""},{"Id":18,"Name":"Dan K","Description":""},{"Id":19,"Name":"Darcy B","Description":""},{"Id":20,"Name":"Dave M","Description":""},{"Id":21,"Name":"David E","Description":""},{"Id":22,"Name":"David L","Description":""},{"Id":23,"Name":"David R","Description":""},{"Id":24,"Name":"David W","Description":"Gaming started for me in grade two (2) when I played a mage that was magically teleported to the front of a roman legion. So I fireballed them. My GM (also in grade 2) wasn\\'t to good with area calculations or math in general. So I vanquished the whole le"},{"Id":25,"Name":"Dennis H","Description":"I have an extensive background running a wide range of game systems. Starting with AD&D in the early 80's and branching off in to other systems such as Warhammer Fantasy Roleplay, Gurps, Rolemaster, Rifts, Recon, Palladium, Shadowrun, Star Wars d6(west end) and many others. I have DM every version of D&D and I am currently the Local coordinator for D&D 5e for the Belleville area. I have run games at a variety of cons over the years Knight March, Orion, and of course Phantasm.\" I prefer to run games then play in them smile emoticon"},{"Id":26,"Name":"Derek H","Description":"Derek has always been gaming in some sort of capacity. He picked up D&D in 1980 and started to DM in 1983 and has not stopped playing since. He's played Traveller, GURPS and all kinds of wierd wonderful RPGs. While still playing D&D/Pathfinder to this day"},{"Id":27,"Name":"Derek M","Description":""},{"Id":28,"Name":"Duncan J","Description":""},{"Id":29,"Name":"Ed Greenwood","Description":"Ed Greenwood is the creator of the Forgotten Realms fantasy world, which became the setting for his home D&D game in 1975. Play still continues in this long-running campaign, and Ed also keeps busy producing Realmslore for various TSR publications. Ed"},{"Id":30,"Name":"Eddy K","Description":""},{"Id":31,"Name":"Erica M","Description":""},{"Id":32,"Name":"Erik W","Description":"Erik was excited by an ad in Analog Magazine for something called Gamma World. The idea that playing pieces on a board could constitute a mechanism for enacting stories caught his imagination and it hasn't let him go. When not gaming, he teaches secondary school in Toronto and blogs about obscure aspects of theatre history, theory, and literature."},{"Id":33,"Name":"Eugene F","Description":""},{"Id":34,"Name":"Francis B","Description":""},{"Id":35,"Name":"Frank O","Description":""},{"Id":36,"Name":"George B","Description":""},{"Id":37,"Name":"Graham R","Description":""},{"Id":38,"Name":"Greg L","Description":""},{"Id":39,"Name":"Greg S","Description":""},{"Id":40,"Name":"Greig A","Description":""},{"Id":41,"Name":"Ian M","Description":""},{"Id":42,"Name":"Ian P","Description":""},{"Id":43,"Name":"Irene M","Description":""},{"Id":44,"Name":"Jacob H","Description":""},{"Id":45,"Name":"James","Description":""},{"Id":46,"Name":"James A","Description":""},{"Id":47,"Name":"James K","Description":"In 1987 James Kerr placed a peanut butter sandwich in his parent's VCR and was transported to a magical world where he was taught by long-dead druids the secrets of dice rolling, community, and dungeon mastership. Returning to this world he has been playi"},{"Id":48,"Name":"James L","Description":"Been away for a couple of years.  I am happy to be running a few events again for Phantasm. I am looking to try and get Palladium Books some recognition again as here in Peterborough it really is not known well at all."},{"Id":49,"Name":"Jared K","Description":""},{"Id":50,"Name":"Jason B","Description":"is a deviant mind of the highest caliber who has been running LARP for Phantasm for 7 years."},{"Id":51,"Name":"Jay L","Description":""},{"Id":52,"Name":"Jason M","Description":"is a two-time winner of the Hammer of Plot and overall awesome human being.  He is a GM that is all about keeping his players entertained.  His material is light on planning and heavy on over-the-top action.  If you attend Phantasm, you owe it to yourself"},{"Id":53,"Name":"Jaymz L","Description":""},{"Id":54,"Name":"Jayson P","Description":""},{"Id":55,"Name":"Jean Marc S","Description":"Jean-Marc has been coming out to the con for a while now and always is a con favourite. He runs a number of games of his own creation like \\\"Fallout\\\"."},{"Id":56,"Name":"Jeff C","Description":""},{"Id":57,"Name":"Jeff K","Description":""},{"Id":58,"Name":"Jeff P","Description":""},{"Id":59,"Name":"Jessika E","Description":""},{"Id":60,"Name":"John P","Description":""},{"Id":61,"Name":"Jon Mark J","Description":"If we could find a way to harness this man’s energy we would solve the energy crisis hands down. Jon Mark runs a high energy game full of drama where hero exemplify what it is to be a hero."},{"Id":62,"Name":"Jon Moore","Description":"Jon has been playing and running games since he was 12 and purchased the D&D Red Box in a whim, over 20 years ago.  Moving quickly from D&D to Rifts, he owns a metric ton of all manner of Palladium Source material. Now well-dedicated to the GURPS system,"},{"Id":63,"Name":"Jordan G","Description":" The Self-Proclaimed Overlord Game Master of Mississauga, Jordan has carved out a niche with his expansive library of over a hundred games; If you enjoy fast, light and fun RPGs you'll not be disappointed at his table. "},{"Id":64,"Name":"Joshua K","Description":""},{"Id":65,"Name":"Justin L","Description":""},{"Id":66,"Name":"Kat J","Description":""},{"Id":67,"Name":"Lance S","Description":""},{"Id":68,"Name":"Lawrence M","Description":"Lawrence we got from Orion, and we’re quite glad to have him. He runs D20 Cthulu for us, and puts a ton of effort into it."},{"Id":69,"Name":"Lawrence W","Description":"Lawrence Whitaker has been role-playing since the ice sheets started to recede and claims he has a genuine knuckle-bone d20 - although this might not be true. What is true is that Lawrence has over 25 years of experience as a player, GM and games writer."},{"Id":70,"Name":"Malcolm S","Description":"Malcolm Sheppard has been writing and designing roleplaying games for about a decade, beginning with material for White Wolf\\'s classic Mage: The Ascension line. Since then he\\'s gone to work on the current World of Darkness (Mage, Changeling and Geist),"},{"Id":71,"Name":"Mark R","Description":""},{"Id":72,"Name":"Matt Clark","Description":""},{"Id":73,"Name":"Matthew K","Description":""},{"Id":74,"Name":"Michel L","Description":""},{"Id":75,"Name":"Mike C","Description":""},{"Id":76,"Name":"Mike K","Description":""},{"Id":77,"Name":"Mike M","Description":""},{"Id":78,"Name":"Nathan D","Description":" I believe in stories because they define who we are.  An avid rpg’s since the first red book to the latest 5th edition, I bring decades of experience in storytelling to the table.  An avid 3d printer for the last 5 years, I bring over 500 3d printed terrain and scatter to the game.   I love telling stories in a visual and dramatic way. "},{"Id":79,"Name":"Nick S","Description":"Nick puts a ton of effort and play testing into his games, its great to see a table get drawn into one of his woven tales."},{"Id":80,"Name":"Paige W","Description":""},{"Id":81,"Name":"Pathfinder Society","Description":""},{"Id":82,"Name":"Paul G","Description":""},{"Id":83,"Name":"Paul K","Description":""},{"Id":84,"Name":"Peter L","Description":"Peter L is a old school GM with a new school feel. He runs great games that focus on fun and letting the PC\\'s be hero\\'s who can do cool things."},{"Id":85,"Name":"Peterborough X-Wing Squadron","Description":""},{"Id":86,"Name":"Rebecca Z","Description":""},{"Id":87,"Name":"Robert H","Description":""},{"Id":88,"Name":"Roland K","Description":""},{"Id":89,"Name":"Rolando M","Description":""},{"Id":90,"Name":"Scott B","Description":""},{"Id":91,"Name":"Sean M","Description":""},{"Id":92,"Name":"Shawn L","Description":"I am currently a Press Ganger for Privateer Press, which is to say that I am a volunteer gameplay coordinator for Privateer Press Products. I've been doing this officially for just under a year, but have been demoing Privateer Press Products for three. I have been plying RPGs since I was 12 with an old copy of 1st edition Advanced Dungeons and Dragons, and have played multiple RPGs over the past 23 years both as a PC and as a Game Master. I expanded into Miniature war gaming with Warhammer 40,00 with an Eldar and a Space Wolves Army. I decided that after surviving the supposed end of the world of 2012, I felt that a great reward for my survivability would be learning to play a new game. I started playing Hordes and then moved to Include Warmachine. Recently I have started to add the iron Kingdoms RPG to my repertoire of games supported and have had a fantastic time hosting and playing this RPG."},{"Id":93,"Name":"Steve C","Description":"Steve runs these great games that focus around the players and build on their actions. If you get a chance you have to try some of the games of Steve\\’s own design, they are pretty fun."},{"Id":94,"Name":"Steve E","Description":"Steve has the largest RPG collection I’ve ever seen. He loves to dive into new games and settings. When he runs a game he focuses entirely on the story and player’s enjoyment, the rules come second."},{"Id":95,"Name":"Stu M","Description":""},{"Id":96,"Name":"TBA","Description":""},{"Id":97,"Name":"Tom T","Description":""},{"Id":98,"Name":"Trevor L","Description":""},{"Id":99,"Name":"Xavier D","Description":""},{"Id":100,"Name":"Dave G ","Description":"Ever since one kid brought the 3rd Ed starter box to school one day in 2000, my make belief had a framework that make it so much better, more fun and good deal more Epic.\n\nWith the new publishing/Kickstarter funding renewal for there are more games with more amazing mechanics than I could ever imagine.\n\nThough little of that seems to matter because in the end the villains always seem to be Drow, Cults of the King in Yellow, or Mindflayers, just done in so many ways!\n\nI have probably several dozen games on my shelf I've never tried and it's only with an adventurous group of players (with at least semi consistent schedules) that we'll get to see them all and discover all they have to offer.\n\nI'm looking to immerse my players in the story and have three priorities in this order: fun, storyline, rules as written. "},{"Id":101,"Name":"Andrew L ","Description":""},{"Id":102,"Name":"Michael Pay","Description":""},{"Id":103,"Name":"Nathan D ","Description":""},{"Id":104,"Name":"Jason M ","Description":""},{"Id":105,"Name":"Sean N ","Description":""},{"Id":106,"Name":"Bryan M ","Description":""},{"Id":107,"Name":"Ian M ","Description":""},{"Id":108,"Name":"Terry B ","Description":""},{"Id":109,"Name":"Mac F","Description":""},{"Id":110,"Name":"Mac F ","Description":""},{"Id":111,"Name":"Derek M ","Description":""},{"Id":112,"Name":"John P ","Description":""}]}